Let's start by importing pandas. The convention is to alias it as *pd*, but that's optional.

In [2]:
import pandas as pd

## Basic Operations

For basic operations we'll create a toy dataset in Python, both literally and figuratively.

In [76]:
toy_data = { 0: {'toy_type': 'car', 'weight': 12, 'size': 9 },
             1: {'toy_type': 'rocking horse', 'weight': 147, 'size': 82 },
             2: {'toy_type': 'ball', 'weight': 44, 'size': 31 },
             3: {'toy_type': 'plastic brick', 'weight': 1, 'size': 2 },
             4: {'toy_type': 'spinning top', 'weight': 6, 'size': 4 }
           }
toys = pd.DataFrame.from_dict(toy_data,orient='index')

### Extracting Values
#### Extract all values from one column

In [77]:
toys['toy_type'] # produces a pandas Series

0              car
1    rocking horse
2             ball
3    plastic brick
4     spinning top
Name: toy_type, dtype: object

Note: the below is also valid:

    toys.toy_type

because pandas will automatically create properties for each column.

However, I would advise against this, because you never know when a column might have the same name as a valid pandas operation. For example, let's say we have a new column called 'shape' to describe the shape of a toy. In this case, when you type

    toys.shape

pandas **won't** return a Series of all the values in the shape column. Instead, it will give you the tuple that tells you how many rows, columns you have (which is the default .shape property in pandas).

By using the square bracket notation to access columns, you avoid this kind of confusion.

#### Extract all values from multiple columns

In [54]:
toys[['toy_type', 'weight']] # produces a pandas DataFrame

        toy_type  weight
0            car      12
1  rocking horse     147
2           ball      44
3  plastic brick       1
4   spinning top       6

#### Extract all values from a single row

In [59]:
toys.ix[0] # produces a pandas Series

size          9
weight       12
toy_type    car
Name: 0, dtype: object

#### Extract multiple rows

In [61]:
toys.ix[0:2] # produces a pandas DataFrame

   size  weight       toy_type
0     9      12            car
1    82     147  rocking horse
2    31      44           ball

#### Extract a subset of rows and columns
Things to remember:
* order of row/column indexing doesn't matter

In [90]:
toys.ix[1:3][['size', 'weight']] # produces a pandas DataFrame
toys[['size', 'weight']].ix[1:3] # this is equivalent to the above

   size  weight
1    82     147
2    31      44
3     2       1

### Conditional Selection
#### Filter on single condition

In [78]:
toys[toys['size'] > 5]

   size  weight       toy_type
0     9      12            car
1    82     147  rocking horse
2    31      44           ball

#### Filter on multiple conditions
Things to remember:
* put brackets around each condition
* use bitwise and (&) and bitwise or (|) to chain conditions, NOT 'and' or 'or'

In [82]:
toys[(toys['size'] > 5) & (toys['weight'] < 40)]

   size  weight toy_type
0     9      12      car

#### Filter, then extract a subset
Things to remember:
* filter first, then specify the subset

In [94]:
toys[(toys['size'] > 5)].ix[0][['toy_type', 'size']]

toy_type    car
size          9
Name: 0, dtype: object

## Real Data

Now that we've done some basic operations on a toy dataset, let's see how to work with 'real' datasets.

It's a cop out, but I'll use the Titanic dataset from Kaggle (available here: https://www.kaggle.com/c/titanic)

Let's read in our csv file:

In [3]:
# read in our dataset from a .csv file
df = pd.read_csv('titanic.csv')

 We could easily read in another kind of file with a different method, e.g. Excel:

    pd.read_excel(...)

#### DataFrame quick overview
Let's have a quick look at our dataset to begin with. One way is just to look at the first 5 rows:

In [112]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

This is fine for 12 variables. What if we have 100? We could look at the column names and datatypes to get an idea of the data instead:

In [113]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

This is a more intuitive way to see what kind of columns we're dealing with. For even more information, you can also use .info():

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.5+ KB

#### Show number of nulls per column
This is great because we can figure out which columns have missing values. To make this easier for large datasets, you can do something like:

In [115]:
for c in df.columns:
    print('{0} has {1} nulls'.format(c, len(df[df[c].isnull()])))

PassengerId has 0 nulls
Survived has 0 nulls
Pclass has 0 nulls
Name has 0 nulls
Sex has 0 nulls
Age has 177 nulls
SibSp has 0 nulls
Parch has 0 nulls
Ticket has 0 nulls
Fare has 0 nulls
Cabin has 687 nulls
Embarked has 2 nulls

Let's break that down.

We'll loop through the columns, which is just a Python list. For each of the columns, we're retrieving the Pandas Series just for that column, then extracting the missing values using

    df[c].isnull()

This just gives us a list of True/False values, which we use to re-index the DataFrame (to extract only the values where .isnull() is True):

    df[df[c].isnull()]

The length of this is then the number of missing values for that column.

*(As an aside: I used fancy formatting using .format(), the full documentation is here: https://docs.python.org/2/library/string.html#format-string-syntax)*

## Data Wrangling

#### Show rows with missing values

In [3]:
df[df.isnull().any(axis=1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C
12,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35,0,0,239865,26.0000,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15,0,0,330923,8.0292,NaN,Q
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21,0,0,A./5. 2152,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
852,853,0,3,"Boulos, Miss. Nourelain",female,9,1,1,2678,15.2458,NaN,C
854,855,0,2,"Carter, Mrs. Ernest Courtenay (Lilian Hughes)",female,44,1,0,244252,26.0000,NaN,S
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18,0,1,392091,9.3500,NaN,S
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45,1,1,36928,164.8667,NaN,S
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24,0,3,2666,19.2583,NaN,C
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
860,861,0,3,"Hansen, Mr. Claus Peter",male,41,2,0,350026,14.1083,NaN,S
861,862,0,2,"Giles, Mr. Frederick Edward",male,21,1,0,28134,11.5000,NaN,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27,1,0,SC/PARIS 2149,13.8583,NaN,C
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26,0,0,349248,7.8958,NaN,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,NaN,Q

#### Fill in missing values
One common thing to do is use the mean value to fill in missing values. Let's do that. We'll also round so we don't get non-integer values.

In [6]:
df['Age'].fillna(round(df['Age'].mean(), 0), inplace=True)
# let's verify that it worked:
print('Age has {0} nulls'.format(len(df[df['Age'].isnull()])))

Age has 0 nulls

Note:

    .fillna()
is used to fill in the missing values, but on its own it returns a copy of the DataFrame or Series. To ensure the changes are actually made, use *inplace=True*

#### Create new columns using existing values
For example, let's create two new columns based on age. One that's just double the age, and on for "ideal partner age" using the old, anecdotal "half your age plus seven" ahem... "algorithm".

In [7]:
df['DoubleAge'] = df['Age'] * 2 # simple vectorised operation
df['IdealPartnerAge'] = df['Age'].map(lambda x: int((x/2) + 7)) # more complex operation, using .map()
df[['Age', 'DoubleAge', 'IdealPartnerAge']].head()

   Age  DoubleAge  IdealPartnerAge
0   22         44               18
1   38         76               26
2   26         52               20
3   35         70               24
4   35         70               24

#### Drop a column
Things to remember:
* Again, this returns a copy by default so use inplace=True
* Use axis=1 to drop the column properly

In [119]:
df.drop('Cabin', axis=1, inplace=True)

#### Drop rows with NA values in a specific column

In [121]:
df.dropna(axis=0, subset=['Embarked'], inplace=True)